---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CurtainGridOffHost
source: html/e15d5350-573e-9dd3-c444-2552597efa45.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CurtainGridOffHost Property

Curtain grid has left its host.

## Syntax (C#)
```csharp
public static FailureDefinitionId CurtainGridOffHost { get; }
```